src/test/resources/expectedSnilsRequesBeforeUuid.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns="urn://x-artefacts-smev-gov-ru/services/message-exchange/types/1.1" xmlns:ns1="urn://x-artefacts-smev-gov-ru/services/message-exchange/types/basic/1.1">
  <soapenv:Header/>
  <soapenv:Body>
    <ns2:SendRequestRequest xmlns:ns2="urn://x-artefacts-smev-gov-ru/services/message-exchange/types/faults/1.1">
      <ns2:SenderProvidedRequestData Id="SIGNED_BY_CALLER">
        <ns2:MessageID>?</ns2:MessageID>
        <ns:ReferenceMessageID>?</ns:ReferenceMessageID>
        <ns:TransactionCode>?</ns:TransactionCode>
        <ns:NodeID>?</ns:NodeID>
        <ns:EOL>?</ns:EOL><ns1:MessagePrimaryContent/><ns:PersonalSignature/>
        <ns1:AttachmentHeaderList>
          <ns1:AttachmentHeader>
            <ns1:contentId>?</ns1:contentId>
            <ns1:MimeType>?</ns1:MimeType>
            <ns1:SignaturePKCS7>cid:1202495970287</ns1:SignaturePKCS7>
          </ns1:AttachmentHeader>
        </ns1:AttachmentHeaderList>
        <ns1:RefAttachmentHeaderList>
          <ns1:RefAttachmentHeader>
            <ns1:uuid>?</ns1:uuid>
            <ns1:Hash>?</ns1:Hash>
            <ns1:MimeType>?</ns1:MimeType>
            <ns1:SignaturePKCS7>cid:1048540585166</ns1:SignaturePKCS7>
          </ns1:RefAttachmentHeader>
        </ns1:RefAttachmentHeaderList><ns:BusinessProcessMetadata/><ns:TestMessage/>
      </ns2:SenderProvidedRequestData>
      <ns1:AttachmentContentList>
        <ns1:AttachmentContent>
          <ns1:Id>?</ns1:Id>
          <ns1:Content>cid:1527896676542</ns1:Content>
        </ns1:AttachmentContent>
      </ns1:AttachmentContentList><ns:CallerInformationSystemSignature/>
    </ns2:SendRequestRequest>
  </soapenv:Body>
</soapenv:Envelope>
